Revit 2026 API

# FailureMessageAccessorGetSeverity Method

---

Retrieves the severity of the failure.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public FailureSeverity GetSeverity()
```
```vb
Public Function GetSeverity As FailureSeverity
```
```cpp
public:
FailureSeverity GetSeverity()
```
```fsharp
member GetSeverity : unit -> FailureSeverity
```

#### Return Value

FailureSeverity The severity of the failure.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | This FailureMessageAccessor has not been properly initialized. |

#### Reference

FailureMessageAccessor Class

Autodesk.Revit.DB Namespace